# Làm sạch dữ liệu cơ bản

## 1. Tạo dữ liệu  ##

In [22]:
import pandas as pd 

data = {
    "id" : [1,2,3,4,5],
    "name" : ["Anh","Em","Phong","Phú", None],
    "age" : [15,14,18,27,50],
    "email" :["Anh@vlu.edu.vn","Em@gmail.com","Phong@vanlanguni.vn","Phu@yahoo.com",None],
    "salary" : [None,70000,10000,250000,15000]
}
df = pd.DataFrame(data)
print(df)

   id   name  age                email    salary
0   1    Anh   15       Anh@vlu.edu.vn       NaN
1   2     Em   14         Em@gmail.com   70000.0
2   3  Phong   18  Phong@vanlanguni.vn   10000.0
3   4    Phú   27        Phu@yahoo.com  250000.0
4   5   None   50                 None   15000.0

In [2]:
# Lấy ra 5 dòng đầu tiên 
df.head()

   id   name  age                email    salary
0   1    Anh   15       Anh@vlu.edu.vn       NaN
1   2     Em   14         Em@gmail.com   70000.0
2   3  Phong   18  Phong@vanlanguni.vn   10000.0
3   4    Phú   27        Phu@yahoo.com  250000.0
4   5   None   50                 None   15000.0

In [4]:
# Kiểm tra dữ liệu thiếu 
df.isnull().sum()

id        0
name      1
age       0
email     1
salary    1
dtype: int64

In [26]:
# Điền giá trị thiếu cho cột salary = giá trị trung bình
df["salary"].fillna(df["salary"].mean(), inplace=True)

In [8]:
# Điền giá trị thiếu bằng Unknow cho cột name và email
df["name"].fillna("Unkown", inplace=True) 
df["email"].fillna("Unkown", inplace=True)

In [27]:
# Kiểm tra lại dữ liệu thiếu 
df.isnull().sum()

id        0
name      1
age       0
email     1
salary    0
dtype: int64

In [28]:
# loại bỏ dữ liệu trùng lặp
df.drop_duplicates(inplace=True)
df

   id   name  age                email    salary
0   1    Anh   15       Anh@vlu.edu.vn   86250.0
1   2     Em   14         Em@gmail.com   70000.0
2   3  Phong   18  Phong@vanlanguni.vn   10000.0
3   4    Phú   27        Phu@yahoo.com  250000.0
4   5   None   50                 None   15000.0

In [35]:
# Chuyển hóa hóa cột name bằng cách viết hoa chữ cái đầu 
df["name"] = df["name"].str.title()
df

   id   name  age                email    salary
0   1    Anh   15       Anh@vlu.edu.vn   86250.0
1   2     Em   14         Em@gmail.com   70000.0
2   3  Phong   18  Phong@vanlanguni.vn   10000.0
3   4    Phú   27        Phu@yahoo.com  250000.0
4   5   None   50                 None   15000.0

In [36]:
# Chuyển hóa hóa cột email bằng cách chuyển về chữ thường  
df["email"] = df["email"].str.lower()
df

   id   name  age                email    salary
0   1    Anh   15       anh@vlu.edu.vn   86250.0
1   2     Em   14         em@gmail.com   70000.0
2   3  Phong   18  phong@vanlanguni.vn   10000.0
3   4    Phú   27        phu@yahoo.com  250000.0
4   5   None   50                 None   15000.0

In [38]:
# Lưu dữ liệu đã làm sạch
df.to_csv("Dữ liệu đã làm sạch.csv", index = False)
df

   id   name  age                email    salary
0   1    Anh   15       anh@vlu.edu.vn   86250.0
1   2     Em   14         em@gmail.com   70000.0
2   3  Phong   18  phong@vanlanguni.vn   10000.0
3   4    Phú   27        phu@yahoo.com  250000.0
4   5   None   50                 None   15000.0

# Bài tập về nhà

### Cho dữ liệu dirty_data.csv 
1. Kiểm tra dữ liệu bị thiếu :
    - Kiểm tra các cột có dữ liệu thiếu
    - Điền giá trị phù hợp hoặc bỏ các hàng có quá nhiều dữ liệu thiếu 
2. Phát hiện và sửa lỗi dữ liệu bất thường :
    - Tìm các giá trị bất thường trong cột tuổi (age) có thể là âm hoạc quá lớn 
    - Kiểm tra cột thu nhập (income) để phát hiện lỗi bị sai
3. Chuyển hóa dạng dữ liệu :
    - Chuyển đổi cột ngày sinh về dạng chuẩn yyyy-mm-dd
    - Chuyển hóa dữ liệu trong cột giới tính (gender) để chỉ có 2 giới tính phù hợp là "Female" và "Male"
4. Xóa bỏ dữ liệu trùng lặp 
    - Xác định và xóa các bản ghi trùng lặp dựa trên thông tin khách hàng
5. Xuất dữ liệu sạch:
Lưu tập dữ liệu đã làm sạch thành tệp mới clean_data.csv

In [2]:
import pandas as pd

# Tạo nội dung dữ liệu bẩn
dirty_data_content = """customer_id,name,age,gender,dob,income,email
101,Nguyen Van A,25.0,Male,1998-05-22,1200,a@example.com
102,Tran Thi B,42.0,Female,1981-07-14,4500,b@example.com
103,Le Van C,-5.0,male,12/03/1995,3200,c@example.com
104,Hoang Minh D,150.0,F,1980/08/25,-500,d@example.com
105,Pham Thi E,30.0,Fem,1993-09-30,,e@example.com
106,Nguyen Van F,,M,1996-11-02,2500,f@example.com
107,Bui Thi G,29.0,Female,1994/06/15,3800,g@example.com
108,Dang Van H,40.0,f,1990-01-29,4200,h@example.com
109,Vo Thi I,27.0,Male,1995-04-10,3900,i@example.com
110,Phan Van J,22.0,unknown,1999-12-20,unknown,j@example.com
110,Phan Van J,22.0,Male,1999-12-20,3900,j@example.com"""

# Lưu dữ liệu vào tệp CSV
file_path = "dirty_data.csv"
with open(file_path, "w", encoding="utf-8") as f:
    f.write(dirty_data_content)

# Đọc dữ liệu từ tệp
df = pd.read_csv(file_path)

# 1. Kiểm tra dữ liệu bị thiếu
missing_data = df.isnull().sum()

# Xử lý dữ liệu thiếu
df = df.dropna(subset=['age', 'income'])  # Bỏ dòng có quá nhiều dữ liệu thiếu
df['income'] = df['income'].replace('unknown', None).astype(float)
df['income'].fillna(df['income'].median(), inplace=True)  # Điền giá trị trung vị

# 2. Phát hiện và sửa lỗi dữ liệu bất thường
df.loc[df['age'] < 0, 'age'] = df['age'].median()  # Sửa tuổi âm thành trung vị
df.loc[df['age'] > 100, 'age'] = df['age'].median()  # Giới hạn tuổi tối đa
df.loc[df['income'] < 0, 'income'] = df['income'].median()  # Sửa thu nhập âm

# 3. Chuyển hóa dạng dữ liệu
df['dob'] = pd.to_datetime(df['dob'], errors='coerce').dt.strftime('%Y-%m-%d')  # Chuyển đổi ngày sinh

# Chuyển đổi giới tính
gender_map = {'Male': 'Male', 'Female': 'Female', 'M': 'Male', 'F': 'Female', 'Fem': 'Female', 'f': 'Female', 'm': 'Male'}
df['gender'] = df['gender'].map(gender_map).fillna('Unknown')

# 4. Xóa bỏ dữ liệu trùng lặp
df = df.drop_duplicates(subset=['customer_id', 'email'])

# 5. Xuất dữ liệu sạch
clean_file_path = "clean_data.csv"
df.to_csv(clean_file_path, index=False)

print(f"Dữ liệu sạch đã được lưu tại: {clean_file_path}")

Dữ liệu sạch đã được lưu tại: clean_data.csv

C:\Users\HP\AppData\Local\Temp\ipykernel_21340\3828088883.py:31: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['income'].fillna(df['income'].median(), inplace=True)  # Điền giá trị trung vị